НВ_Доработки/Documents/РеализацияТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияТоваровИУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

НВ_Доработки/AccumulationRegisters/РасчетыПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РасчетыПоЗаказам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

НВ_Доработки/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

НВ_Доработки/Documents/РеализацияТоваровИУслуг/Ext/ManagerModule.bsl
&ИзменениеИКонтроль("ПолучитьДанныеДляПечатныхФорм")
Функция НВД_ПолучитьДанныеДляПечатныхФорм(МассивОбъектов, ВключатьТовары, ВключатьУслуги)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ВключатьТовары", ВключатьТовары);
	Запрос.УстановитьПараметр("ВключатьУслуги", ВключатьУслуги);
	Запрос.УстановитьПараметр("КолонкаАртикул", Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить());
	Запрос.Текст = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.ПометкаУдаления КАК ПометкаУдаления,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	""01.01.2001"" КАК ДатаДокумента,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.Склад КАК Склад,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.АдресДоставки КАК АдресДоставки,
	|	ДанныеДокумента.АдресМонтажа КАК АдресМонтажа,
	|	ДанныеДокумента.ВидЦен КАК ВидЦен,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.Автор КАК Автор,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Организация.ПолноеНаименование = """"
	|			ТОГДА ДанныеДокумента.Организация.ПолноеНаименование
	|		ИНАЧЕ ДанныеДокумента.Организация.Наименование
	|	КОНЕЦ КАК ПредставлениеОрганизации,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчет,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет.НомерСчета КАК БанковскийСчетНомерСчета,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет.БИК КАК БанковскийСчетБИК,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет.КоррСчет КАК БанковскийСчетКоррСчет,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет.НаименованиеБанка КАК БанковскийСчетНаименованиеБанка,
	|	ДанныеДокумента.Организация.ИдентификационныйНомерПлательщикаЕвропейскогоНДС КАК ИдентификационныйНомерПлательщикаЕвропейскогоНДС,
	|	ДанныеДокумента.Организация.ИНН КАК ИНН,
	|	ДанныеДокумента.Организация.КПП КАК КПП,
	|	ДанныеДокумента.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
	|	ДанныеДокумента.Организация.СтавкаНДСПоУмолчанию КАК СтавкаНДС,
	|	ДанныеДокумента.Организация.ЯвляетсяПлательщикомНДС КАК ОрганизацияЯвляетсяПлательщикомНДС,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
	|			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
	|		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
	|	КОНЕЦ КАК КонтрагентНаименованиеПолное,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
	|			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
	|		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
	|	КОНЕЦ КАК ПредставлениеКонтрагента,
	|	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Контрагент.КПП КАК КонтрагентКПП,
	|	ДанныеДокумента.Контрагент.ИдентификационныйНомерПлательщикаЕвропейскогоНДС КАК КонтрагентИдентификационныйНомерПлательщикаЕвропейскогоНДС,
	|	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.НомерСчета КАК КонтрагентБанковскийСчетНомерСчета,
	|	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.БИК КАК КонтрагентБанковскийСчетБИК,
	|	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.КоррСчет КАК КонтрагентБанковскийСчетКоррСчет,
	|	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.НаименованиеБанка КАК КонтрагентБанковскийСчетНаименованиеБанка,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Руководитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.Организация.Руководитель.Должность
	|		ИНАЧЕ ДанныеДокумента.Руководитель.Должность
	|	КОНЕЦ КАК ДолжностьРуководителя,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Руководитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.Организация.Руководитель.РасшифровкаПодписи
	//++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.Руководитель.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.Руководитель.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Руководитель)
	|		ИНАЧЕ ДанныеДокумента.Руководитель.РасшифровкаПодписи
	//-- №4051
	|	КОНЕЦ КАК ФИОРуководителя,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ГлавныйБухгалтер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.Организация.ГлавныйБухгалтер.РасшифровкаПодписи
	//++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.ГлавныйБухгалтер)
	|		ИНАЧЕ ДанныеДокумента.ГлавныйБухгалтер.РасшифровкаПодписи
	//-- №4051
	|	КОНЕЦ КАК ФИОГлавБухгалтера,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Отпустил = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.Автор.Сотрудник.Должность
	|		ИНАЧЕ ДанныеДокумента.Отпустил.Должность
	|	КОНЕЦ КАК ДолжностьКладовщика,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Отпустил = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.Автор.Сотрудник.РасшифровкаПодписи
	//++ №4051 всегда смотрим на расшифровку подписи, а не наименование
	//|		КОГДА НЕ ДанныеДокумента.Отпустил.РасшифровкаПодписи = """"
	//|			ТОГДА ДанныеДокумента.Отпустил.РасшифровкаПодписи
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Отпустил)
	|		ИНАЧЕ ДанныеДокумента.Отпустил.РасшифровкаПодписи
	//-- №4051
	|	КОНЕЦ КАК ФИОКладовщика,
	|	ДанныеДокумента.Основание КАК Основание,
	|	ДанныеДокумента.Основание.Дата КАК ДатаОснования,
	|	""01.01.2001"" КАК ДатаДокументаОснования,
	|	ДанныеДокумента.Основание.Номер КАК НомерОснования,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ""Заказ покупателя""
	|		КОГДА ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказДоговор
	|			ТОГДА ""Заказ-договор""
	|		КОГДА ДанныеДокумента.Основание ССЫЛКА Документ.ПоступлениеТоваровИУслуг
	|			ТОГДА ""Поступление товаров и услуг""
	|		КОГДА ДанныеДокумента.Основание ССЫЛКА Документ.ПеремещениеТоваров
	|			ТОГДА ""Перемещение товаров""
	|		КОГДА ДанныеДокумента.Основание ССЫЛКА Документ.ЗаказНаПроизводство
	|			ТОГДА ""Заказ на производство""
	|	КОНЕЦ КАК ВидОснования,
	|	ДанныеДокумента.СуммаБонусовКСписанию КАК СуммаБонусовКСписанию,
	|	ДанныеДокумента.СуммаБонусовКСписаниюПоДисконтнойКарте КАК БонусовСписано,
	|	ДанныеДокумента.СуммаБонусовКНачислениюПоДисконтнойКарте КАК БонусовНачислено,
	|	ЕСТЬNULL(БонусыКонтрагентовОстатки.СуммаОстаток, 0) КАК БонусОстатки,
	|	ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) КАК ДолгПоРеализации,
	|	ДанныеДокумента.СуммаДокумента - ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) КАК ОплаченоПоРеализации,
	|	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток, 0) КАК ТекущийДолг,
	|	0 КАК ДолгКонтрагентаНаДатуДокумента,
	|	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток, 0) КАК ДолгКонтрагентаНаТекущуюДату,
	|	0 КАК ОстатокБонусовКонтрагентаНаДатуДокумента,
	|	0 КАК ОстатокБонусовКонтрагентаНаТекущуюДату,
	|	КонстантаВалютаУчета.Значение КАК ВалютаУчета,
	|	0 КАК ИтогоВес,
	|	0 КАК КоличествоПозиций,
	|	0 КАК ИтогоСумма,
	|	0 КАК ИтогоСуммаНДС,
	|	0 КАК ИтогоСуммаБезНДС,
	|	""текст расшифровки НДС"" КАК НДС
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК ДанныеДокумента

	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БонусыКонтрагентов.Остатки КАК БонусыКонтрагентовОстатки
	|		ПО ДанныеДокумента.Контрагент = БонусыКонтрагентовОстатки.Контрагент
	|			И ДанныеДокумента.ДисконтнаяКарта = БонусыКонтрагентовОстатки.ДисконтнаяКарта

	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
	|		ПО ДанныеДокумента.Ссылка = РасчетыПоЗаказамОстатки.Заказ
	|			И ДанныеДокумента.Контрагент = РасчетыПоЗаказамОстатки.Контрагент

	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ 
	|							ВзаиморасчетыОстатки.Организация,
	|							ВзаиморасчетыОстатки.Контрагент, 
	|							СУММА(ВзаиморасчетыОстатки.СуммаОстаток) КАК СуммаОстаток
	|						ИЗ
	|							РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ВзаиморасчетыОстатки
	|						СГРУППИРОВАТЬ ПО
	|							Организация, 
	|							Контрагент
	|						) КАК ВзаиморасчетыСКонтрагентамиОстатки
	|		ПО ДанныеДокумента.Контрагент = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
	|			И ДанныеДокумента.Организация = ВзаиморасчетыСКонтрагентамиОстатки.Организация

	|	, Константа.ВалютаУчета КАК КонстантаВалютаУчета
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	#Вставка
	|////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|НоменклатураКратность.Ссылка КАК Номенклатура,
	|НоменклатураКратность.ЕдиницаИзмерения КАК ЕдиницаИзмеренияКратность,
	|НоменклатураКратность.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВТ_Кратность
	|ИЗ
	|	Справочник.Номенклатура.Кратность КАК НоменклатураКратность
	|ГДЕ
	|НоменклатураКратность.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовПроверкиКратности.РеализацияТоваровИУслуг)
	|; 
	#КонецВставки
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ИмяТЧ,
	|	ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
	|	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА &КолонкаАртикул
	|			ТОГДА ДанныеТабличнойЧасти.Номенклатура.Артикул
	|		ИНАЧЕ ДанныеТабличнойЧасти.Номенклатура.Код
	|	КОНЕЦ КАК Код,
	|	ДанныеТабличнойЧасти.Номенклатура.Артикул КАК Артикул,
	|	ДанныеТабличнойЧасти.Номенклатура КАК Номенклатура,
	|	ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДанныеТабличнойЧасти.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ДанныеТабличнойЧасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеТабличнойЧасти.Коэффициент КАК Коэффициент,
	|	ДанныеТабличнойЧасти.Количество КАК Количество,
	|	ДанныеТабличнойЧасти.Цена КАК Цена,
	|	ДанныеТабличнойЧасти.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ДанныеТабличнойЧасти.Сумма КАК Сумма,
	|	ДанныеТабличнойЧасти.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеТабличнойЧасти.СуммаНДС КАК СуммаНДС,
	|	ДанныеТабличнойЧасти.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ДанныеТабличнойЧасти.Количество * ДанныеТабличнойЧасти.Цена КАК СуммаБезСкидки,
	|	ДанныеТабличнойЧасти.Количество * ДанныеТабличнойЧасти.Цена - ДанныеТабличнойЧасти.Сумма КАК Скидка,
	|	ДанныеТабличнойЧасти.Сумма - ДанныеТабличнойЧасти.СуммаНДС КАК СуммаБезНДС,
	|	ДанныеТабличнойЧасти.Сумма КАК СуммаСНДС,
	|	ДанныеТабличнойЧасти.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеТабличнойЧасти.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерений)
	|			ТОГДА ДанныеТабличнойЧасти.ЕдиницаИзмерения.Вес * ДанныеТабличнойЧасти.Количество
	|		ИНАЧЕ ДанныеТабличнойЧасти.Номенклатура.Вес * ДанныеТабличнойЧасти.Количество
	|	КОНЕЦ КАК Вес,
	#Удаление
	|	ДанныеТабличнойЧасти.Потолок КАК Потолок
	|ПОМЕСТИТЬ ВТ_ДанныеТабличнойЧасти
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Товары КАК ДанныеТабличнойЧасти
	|ГДЕ
	|	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
	|	И &ВключатьТовары
	#КонецУдаления
	#Вставка
	|	ДанныеТабличнойЧасти.Потолок КАК Потолок,
    |	ВТ_Кратность.ЕдиницаИзмеренияКратность КАК ЕдиницаИзмеренияКратность,
	|	ВТ_Кратность.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВТ_ДанныеТабличнойЧасти
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Товары КАК ДанныеТабличнойЧасти
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Кратность КАК ВТ_Кратность
	|	ПО (ДанныеТабличнойЧасти.Номенклатура = ВТ_Кратность.Номенклатура И ДанныеТабличнойЧасти.ЕдиницаИзмерения = ВТ_Кратность.ЕдиницаИзмеренияКратность)
	|ГДЕ
	|	ДанныеТабличнойЧасти.Ссылка В (&МассивОбъектов)
	|	И &ВключатьТовары
	#КонецВставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Услуги"",
	|	ДанныеТабличнойЧасти.Ссылка,
	|	ДанныеТабличнойЧасти.НомерСтроки,
	|	ВЫБОР
	|		КОГДА &КолонкаАртикул
	|			ТОГДА ДанныеТабличнойЧасти.Номенклатура.Артикул
	|		ИНАЧЕ ДанныеТабличнойЧасти.Номенклатура.Код
	|	КОНЕЦ,
	|	ДанныеТабличнойЧасти.Номенклатура.Артикул,
	|	ДанныеТабличнойЧасти.Номенклатура,
	|	ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры,
	|	NULL,
	|	ДанныеТабличнойЧасти.ЕдиницаИзмерения,
	|	ДанныеТабличнойЧасти.Коэффициент,
	|	ДанныеТабличнойЧасти.Количество,
	|	ДанныеТабличнойЧасти.Цена,
	|	ДанныеТабличнойЧасти.СуммаРучнойСкидки,
	|	ДанныеТабличнойЧасти.Сумма,
	|	ДанныеТабличнойЧасти.СтавкаНДС,
	|	ДанныеТабличнойЧасти.СуммаНДС,
	|	ДанныеТабличнойЧасти.ПроцентРучнойСкидки,
	|	ДанныеТабличнойЧасти.Количество * ДанныеТабличнойЧасти.Цена,
	|	ДанныеТабличнойЧасти.Количество * ДанныеТабличнойЧасти.Цена - ДанныеТабличнойЧасти.Сумма,
	|	ДанныеТабличнойЧасти.Сумма - ДанныеТабличнойЧасти.СуммаНДС,
	|	ДанныеТабличнойЧасти.Сумма,
	|	ДанныеТабличнойЧасти.ЕдиницаИзмерения.Код,
	|	0,
	|	ДанныеТабличнойЧасти.Потолок КАК Потолок
	#Вставка     
	|	,
	|	ДанныеТабличнойЧасти.ЕдиницаИзмерения,
	|	1
	#КонецВставки
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Услуги КАК ДанныеТабличнойЧасти
	|ГДЕ
	|	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
	|	И &ВключатьУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеТабличнойЧасти.ИмяТЧ КАК ИмяТЧ,
	|	ВТ_ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
	|	ВТ_ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
	|	ВТ_ДанныеТабличнойЧасти.Код КАК Код,
	|	ВТ_ДанныеТабличнойЧасти.Артикул КАК Артикул,
	|	ВТ_ДанныеТабличнойЧасти.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ДанныеТабличнойЧасти.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВТ_ДанныеТабличнойЧасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_ДанныеТабличнойЧасти.Коэффициент КАК Коэффициент,
	|	ВТ_ДанныеТабличнойЧасти.Количество КАК Количество,
	|	ВТ_ДанныеТабличнойЧасти.Цена КАК Цена,
	|	ВТ_ДанныеТабличнойЧасти.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ВТ_ДанныеТабличнойЧасти.Сумма КАК Сумма,
	|	ВТ_ДанныеТабличнойЧасти.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ДанныеТабличнойЧасти.СуммаНДС КАК СуммаНДС,
	|	ВТ_ДанныеТабличнойЧасти.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ВТ_ДанныеТабличнойЧасти.СуммаБезСкидки КАК СуммаБезСкидки,
	|	ВТ_ДанныеТабличнойЧасти.Скидка КАК Скидка,
	|	ВТ_ДанныеТабличнойЧасти.СуммаБезНДС КАК СуммаБезНДС,
	|	ВТ_ДанныеТабличнойЧасти.СуммаСНДС КАК СуммаСНДС,
	|	ВТ_ДанныеТабличнойЧасти.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	ВТ_ДанныеТабличнойЧасти.Вес КАК Вес,
	|	ВТ_ДанныеТабличнойЧасти.Потолок КАК Потолок
	#Вставка     
	|	,
	|	ВТ_ДанныеТабличнойЧасти.Количество / ВЫБОР
	|	КОГДА ЕСТЬNULL(ВТ_ДанныеТабличнойЧасти.Кратность, 0) = 0
	|		ТОГДА 1
	|	ИНАЧЕ ВТ_ДанныеТабличнойЧасти.Кратность
	|	КОНЕЦ КАК КоличествоШтук
	#КонецВставки
	|ИЗ
	|	ВТ_ДанныеТабличнойЧасти КАК ВТ_ДанныеТабличнойЧасти
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ДанныеТабличнойЧасти.Ссылка,
	|	ВТ_ДанныеТабличнойЧасти.ИмяТЧ,
	|	ВТ_ДанныеТабличнойЧасти.НомерСтроки
	|ИТОГИ
	|	КОЛИЧЕСТВО(НомерСтроки),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС),
	|	СУММА(Вес)
	|ПО
	|	Ссылка";    

	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	#Удаление
	РезультатПоТабличнойЧасти = МассивРезультатов[2];
	#КонецУдаления
	#Вставка
	РезультатПоТабличнойЧасти = МассивРезультатов[3];
	#КонецВставки

	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
	РезультатПоШапке, РезультатПоТабличнойЧасти);

	Возврат СтруктураДанныхДляПечати;

КонецФункции

&ИзменениеИКонтроль("СформироватьПечатнуюФормуТоварнойНакладной")
Функция НВД_СформироватьПечатнуюФормуТоварнойНакладной(МассивОбъектов, ОбъектыПечати, ВключатьУслуги)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ТоварнаяНакладная";
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();

	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов, Истина, ВключатьУслуги);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();	
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоТоварам);

	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		#Удаление
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровИУслуг.ПФ_MXL_ТоварнаяНакладная");
		#КонецУдаления
		#Вставка
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровИУслуг.ПФ_MXL_ТоварнаяНакладнаяИЗМ");
		#КонецВставки
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);

			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
			ТабличныйДокумент,
			Макет,
			ОбластьМакета,
			ДанныеПечати.Ссылка);

			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;

		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;

		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Получатель");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;

		//добавим адрес доставки, если поле не пустое		
		Попытка
			Если НЕ ПустаяСтрока(ДанныеПечати.АдресДоставки) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("АдресДоставки");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		Исключение
		КонецПопытки;

		//добавим адрес монтажа, если поле не пустое		
		Попытка
			Если НЕ ПустаяСтрока(ДанныеПечати.АдресМонтажа) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("АдресМонтажа");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		Исключение
		КонецПопытки;

		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Склад");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);		
		Исключение
		КонецПопытки;

		Попытка
			Если ЗначениеЗаполнено(ДанныеПечати.Основание) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Основание");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		Исключение
		КонецПопытки;

		// Изменения размера колонки, в зависимости от вывода Артикула
		Если Не ВыводитьАртикул Тогда
			Попытка
				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
			Исключение
			КонецПопытки;
		КонецЕсли;

		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);

			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;

			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);			
		Исключение
		КонецПопытки;

		//Сумма = 0;
		//Количество = 0;

		НомерСтроки = 1;
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоТоварам.Сбросить();

		Если НЕ ВключатьУслуги Тогда
			Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда				
				Выборка = ВыборкаПоТоварам.Выбрать();
				Пока Выборка.Следующий() Цикл
					Попытка
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);
						ТабличныйДокумент.Вывести(ОбластьМакета);

						Если ВыводитьАртикул Тогда
							ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
							ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
							ОбластьМакета.Параметры.Заполнить(Выборка);
							ТабличныйДокумент.Присоединить(ОбластьМакета);
						КонецЕсли;

						ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);

						//++ №12909
						//ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Выборка.ХарактеристикаНоменклатуры));
						ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры);
						//-- №12909

						ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ПредставлениеНоменклатуры;
						ТабличныйДокумент.Присоединить(ОбластьМакета);

					Исключение
					КонецПопытки;		
				КонецЦикла;
			КонецЕсли;
		Иначе
			// подготовим табличную часть в зависимости от варианта формирования ПФ счета на оплату
			ВариантФормированияПФ = Константы.ВариантФормированияПФРТИУ.Получить();

			МассивДопРеквизитов = Новый Массив;
			МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Артикул", 			Новый ОписаниеТипов("Строка")));
			МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Вес", 				Новый ОписаниеТипов("Число")));

			МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ВидНоменклатуры", 	Новый ОписаниеТипов("Число")));
			МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЕстьПотолок", 		Новый ОписаниеТипов("Число")));
			МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЭтоПотолок", 			Новый ОписаниеТипов("Булево")));
			МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "НомерСтрокиПотолка", 	Новый ОписаниеТипов("Число")));
			МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ГруппаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"))); //#12807

			ТаблицаТоварыИУслуги = ОбщийМодульСервер.ТаблицаЗначенийПоТабличнойЧастиОбъекта("РеализацияТоваровИУслуг", "Товары", МассивДопРеквизитов);

			Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
				Выборка = ВыборкаПоТоварам.Выбрать();			
				Пока Выборка.Следующий() Цикл
					ТекущаяСтрока = ТаблицаТоварыИУслуги.Добавить();
					ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);

					Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
						ТекущаяСтрока.ВидНоменклатуры = 1;
						ТекущаяСтрока.Потолок = ТекущаяСтрока.Номенклатура;
						ТекущаяСтрока.НомерСтрокиПотолка = ТекущаяСтрока.НомерСтроки;
						ТекущаяСтрока.ЭтоПотолок = Истина;

					ИначеЕсли Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
						ТекущаяСтрока.ВидНоменклатуры = 3;
					Иначе
						ТекущаяСтрока.ВидНоменклатуры = 2;
					КонецЕсли;
					Если ТекущаяСтрока.Потолок.Пустая() Тогда
						ТекущаяСтрока.ЕстьПотолок = 2;
					Иначе
						ТекущаяСтрока.ЕстьПотолок = 1;
					КонецЕсли;

					ТекущаяСтрока.ГруппаНоменклатуры = ТекущаяСтрока.Номенклатура.Родитель; //#12807
				КонецЦикла;
			КонецЕсли;			

			ОтступНоменклатуры = "";

			//0. Потолок - товар - услуга - потолок - товар - услуга
			//1. Потолок, Потолок, Товары, Товары, услуги, услуги
			//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются) - услуга (все одинаковые позиции сворачиваются)
			//3. Без группировок
			//4. По группам номенклатуры
			//5. По группам номенклатуры (одинаковые позиции объединяются)
			Если ВариантФормированияПФ = 0 Тогда
				ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, Потолок, ВидНоменклатуры");		
			ИначеЕсли ВариантФормированияПФ = 1 Тогда
				ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры");
			ИначеЕсли ВариантФормированияПФ = 2 Тогда
				ТаблицаТоварыИУслуги.Свернуть("Артикул, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, Цена, ПроцентРучнойСкидки, ВидНоменклатуры", "Количество, Сумма, СуммаРучнойСкидки");
				ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры")
			ИначеЕсли ВариантФормированияПФ = 3 Тогда	
				//не сортируем
			ИначеЕсли ВариантФормированияПФ = 4 Тогда
				ОтступНоменклатуры = "   ";
				ТаблицаТоварыИУслуги.Сортировать("ГруппаНоменклатуры");
				//++ №13374
			ИначеЕсли ВариантФормированияПФ = 5 Тогда
				ТаблицаТоварыИУслуги.Свернуть("Артикул, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, Цена, ПроцентРучнойСкидки, ГруппаНоменклатуры", "Количество, Сумма, СуммаРучнойСкидки");
				ОтступНоменклатуры = "   ";
				ТаблицаТоварыИУслуги.Сортировать("ГруппаНоменклатуры");
				//-- №13374
			КонецЕсли;

			НомерСтроки = 1;
			ТекущаяГруппа = Неопределено;

			Для каждого Выборка из ТаблицаТоварыИУслуги Цикл 

				//#12807
				Если ВариантФормированияПФ = 4
					Или ВариантФормированияПФ = 5 // №13374
					Тогда
					Если НЕ ТекущаяГруппа = Выборка.ГруппаНоменклатуры Тогда
						ТекущаяГруппа = Выборка.ГруппаНоменклатуры;
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
						ТабличныйДокумент.Вывести(ОбластьМакета);
						Если ВыводитьАртикул Тогда						
							ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
							ТабличныйДокумент.Присоединить(ОбластьМакета);
						КонецЕсли;					
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
						ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ?(ТекущаяГруппа.Пустая(), "<...>", ТекущаяГруппа);

						ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,1,1,1);
						ШрифтПотолка = Новый Шрифт(ОбластьМакета.ТекущаяОбласть.Шрифт,,,Истина);
						ОбластьМакета.ТекущаяОбласть.Шрифт = ШрифтПотолка;

						ТабличныйДокумент.Присоединить(ОбластьМакета);
					КонецЕсли;
				КонецЕсли;

				ДопДанныеСтроки = Новый Структура("НомерСтроки", НомерСтроки);

				Попытка
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					ОбластьМакета.Параметры.Заполнить(ДопДанныеСтроки);
					ТабличныйДокумент.Вывести(ОбластьМакета);

					Если ВыводитьАртикул Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);
						ТабличныйДокумент.Присоединить(ОбластьМакета);
					КонецЕсли;	

					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					СтолбецНоменклатуры = 1; // номер столбца в текущей области
					Если ВариантФормированияПФ = 0 И Выборка.ВидНоменклатуры = 1 Тогда
						ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1, СтолбецНоменклатуры, 1, СтолбецНоменклатуры);
						ШрифтПотолка = Новый Шрифт (ОбластьМакета.ТекущаяОбласть.Шрифт,,,Истина);
						ОбластьМакета.ТекущаяОбласть.Шрифт = ШрифтПотолка;
					ИначеЕсли ВариантФормированияПФ = 0 и НЕ Выборка.Потолок.Пустая() Тогда
						ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1, СтолбецНоменклатуры, 1, СтолбецНоменклатуры);
						ОбластьМакета.ТекущаяОбласть.Отступ = 2;
					КонецЕсли;

					//++ №12909
					//Попытка
					//	ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Выборка.ХарактеристикаНоменклатуры));
					//Исключение
					//	ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура);
					//КонецПопытки;
					ПредставлениеНоменклатуры = ОтступНоменклатуры + ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры);
					//-- №12909

					ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ПредставлениеНоменклатуры;
					ТабличныйДокумент.Присоединить(ОбластьМакета);					

				Исключение			
				КонецПопытки;

				НомерСтроки = НомерСтроки + 1;

			КонецЦикла;
		КонецЕсли; //Если НЕ ВключатьУслуги Тогда

		ПрефиксОбласти = ?(ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС, "ИтогоНДС", "Итого");
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть(ПрефиксОбласти + "|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);

			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть(ПрефиксОбласти + "|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;

			ОбластьМакета = Макет.ПолучитьОбласть(ПрефиксОбласти + "|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;

		Попытка 
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВсегоИПрописью");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				ОбластьМакета.Параметры.ИтогоСуммаПрописью = 
				РаботаСВалютой.СформироватьЧислоПрописьюВсп(ДанныеПечати.ИтогоСумма, ДанныеПечати.Валюта, "Л=ru_RU;ДП=Ложь");
			Исключение
			КонецПопытки;		
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;

		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;

		Попытка
			Если ДанныеПечати.БонусовСписано = 0 И ДанныеПечати.БонусовСписано = 0 И ДанныеПечати.БонусОстатки = 0 Тогда
				//пропускаем
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Бонусы");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		Исключение
		КонецПопытки;

		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Долг");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати); 	
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;

		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);		
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;

	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;

	Возврат ТабличныйДокумент;

КонецФункции
